[
    [
      {
        "content": "Instrukcja Obsługi - Vet Portable 15\n    1. Opis urządzenia\n\nVet Portable 15 to zaawansowany system ultrasonograficzny klasy premium,\nzaprojektowany z myślą o mobilności i wydajności diagnostycznej. Dzięki niewielkiej wadze oraz ergonomicznemu designowi urządzenie łatwo mieści się w torbie, co\npozwala na wykonywanie precyzyjnych badań zarówno w terenie, jak i w gabinecie. Nowoczesne funkcje obrazowania oraz intuicyjny interfejs sprawiają, że Vet Portable 15 jest idealnym wyborem dla wymagających użytkowników.\n\n2. Specyficzne ostrzeżenia bezpieczeństwa\nOstrzeżenia dotyczące użytkowania urządzenia:\n    • Unikanie zalania: Urządzenie nie jest odporne na wodę. Należy unikać kontaktu z cieczami, aby zapobiec uszkodzeniu elektroniki. Używaj urządzenia w suchych warunkach.\n    • Przechowywanie: Urządzenie powinno być przechowywane w suchym miejscu, w temperaturze pokojowej, z dala od źródeł ciepła i wilgoci. Zbyt wysokie lub niskie temperatury mogą uszkodzić wewnętrzne komponenty.\n    • Zabezpieczenie przed przeciążeniem elektrycznym: Urządzenie jest zasilane akumulatorem litowo-jonowym. Nie należy używać urządzenia z uszkodzoną ładowarką ani podłączać go do źródeł zasilania, które mogą powodować przepięcia.\n    • Ostrożność w przypadku przegrzania: Jeśli urządzenie nagrzewa się, należy natychmiast je wyłączyć i umożliwić chłodzenie. Używanie urządzenia w wysokich temperaturach może prowadzić do jego uszkodzenia.\n    • Delikatność sondy: Sonda jest wrażliwa na uszkodzenia mechaniczne. Należy zachować ostrożność podczas podłączania i odłączania jej z urządzenia, a także przy jej przechowywaniu.\n    • Zalecane środki dezynfekujące: Do czyszczenia sondy należy używać jedynie zalecanych środków dezynfekujących, aby uniknąć jej uszkodzenia i zapewnić bezpieczeństwo pacjentom.\n\n3. Akcesoria dostępne dla urządzenia\n    • Sonda ultrasonograficzna: Dostarczana w zestawie z urządzeniem, umożliwia różne tryby obrazowania w zależności od typu badania.\n    • Zasilacz sieciowy: Ładowarka do urządzenia, umożliwiająca ładowanie akumulatora litowo-jonowego.\n    • Dedykowane etui ochronne: Przeznaczone do transportu urządzenia w celu zapobiegania uszkodzeniom mechanicznym.\n    • Żel transmisyjny: Niezbędny do wykonywania badań ultrasonograficznych, umożliwia odpowiednią transmisję fal ultradźwiękowych.\n    • Kabel USB: Służy do połączenia urządzenia z komputerem w celu przenoszenia danych lub aktualizacji oprogramowania.\n\n\n\n4. Przygotowanie do pracy\n\n        1. Rozpakuj urządzenie i upewnij się, że wszystkie komponenty są obecne (sonda, zasilacz, instrukcja użytkownika).\n        2. Podłącz sondę ultrasonograficzną do odpowiedniego portu, dbając o prawidłowe wpięcie złącza.\n        3. Sprawdź stan naładowania akumulatora. Jeśli jest niski, podłącz urządzenie do ładowarki sieciowej.\n        4. Włącz urządzenie, naciskając przycisk zasilania. Poczekaj, aż system operacyjny zakończy ładowanie.\n        5. Wybierz odpowiedni tryb badania z menu głównego (np. obrazowanie jamy\nbrzusznej, serca).\n        6. Nałóż cienką warstwę żelu transmisyjnego na sondę oraz na badany obszar\nskóry pacjenta.\n\n5. Tryby pracy\n\nVet Portable 15 oferuje szeroką gamę trybów pracy, dostosowanych do różnych potrzeb\ndiagnostycznych:\n\n    • Tryb B (Basic): Wysokiej jakości obrazowanie w skali szarości.\n    • Tryb M (Motion): Analiza ruchu narządów, szczególnie przydatna w kardiologii.\n    • Kolorowy Doppler: Wizualizacja przepływu krwi w czasie rzeczywistym.\n    • Doppler energetyczny: Umożliwia ocenę przepływów w małych naczyniach.\n    • Tryb adaptacyjny AI: Funkcja wspomagająca automatyczne dopasowanie\nparametrów obrazu w czasie rzeczywistym.\n6. Konserwacja\n\n    1. Po każdym użyciu delikatnie przetrzyj obudowę urządzenia wilgotną szmatką.\n    2. Używaj tylko zalecanych środków dezynfekcyjnych do czyszczenia sondy.\n    3. Nie pozostawiaj urządzenia w miejscach o wysokiej wilgotności ani w bezpośrednim świetle słonecznym.\n    4. Raz w miesiącu wykonaj diagnostykę systemu dostępną w menu serwisowym.\n    5. W przypadku transportu zawsze używaj dedykowanego etui, aby zapobiec\nuszkodzeniom mechanicznym.\n    6. Regularnie sprawdzaj dostępność aktualizacji oprogramowania i instaluj je zgodnie z instrukcją.\n7. Diagnostyka oprogramowania i wsparcie techniczne\nDiagnostyka systemowa:\n    • Dostęp do testów diagnostycznych: Urządzenie oferuje funkcję diagnostyki systemu, która pozwala na sprawdzenie stanu urządzenia, w tym wyświetlacza, sondy i pamięci. Diagnostyka jest dostępna w menu serwisowym i powinna być wykonywana co miesiąc.\n    • Aktualizacje oprogramowania: System powinien regularnie sprawdzać dostępność aktualizacji oprogramowania. Użytkownik jest informowany o dostępnych aktualizacjach, które należy pobrać i zainstalować, aby utrzymać urządzenie w pełnej funkcjonalności.\n\n8. Certyfikaty i normy\nZgodność z normami i certyfikaty:\n    • Certyfikat CE: Urządzenie spełnia wszystkie wymogi unijne dotyczące bezpieczeństwa i jakości, a także normy dotyczące urządzeń medycznych.\n    • FDA: Zgodność z wymaganiami amerykańskiej Agencji Żywności i Leków (FDA) dla urządzeń medycznych.\n    • IEC 60601-1: Urządzenie jest zgodne z międzynarodową normą dotyczącą bezpieczeństwa elektrycznego urządzeń medycznych.\n    • ISO 13485: Urządzenie jest certyfikowane zgodnie z międzynarodową normą dotyczącą systemu zarządzania jakością w produkcji wyrobów medycznych.\n9. Przykładowe przypadki użycia\n9.1 Badanie serca psa:\n    • Tryb pracy: Tryb M (Motion) dla dynamicznego obrazowania pracy serca.\n    • Sonda: Sonda o częstotliwości 5 MHz, dostosowana do większych zwierząt.\n    • Instrukcja: Nałóż żel na sondę, umieść sondę na klatce piersiowej psa i przeanalizuj obraz w trybie Motion, aby ocenić funkcję serca.\n9.2 Badanie jamy brzusznej kota:\n    • Tryb pracy: Tryb B (Basic), zapewniający obrazowanie w skali szarości.\n    • Sonda: Sonda o częstotliwości 8 MHz, dostosowana do małych zwierząt.\n    • Instrukcja: Nałóż odpowiednią ilość żelu na obszar brzuszny kota, ustaw odpowiednią głębokość skanowania, aby uzyskać wyraźny obraz narządów wewnętrznych.\n9.3 Badanie przepływu krwi w naczyniach u konia:\n    • Tryb pracy: Kolorowy Doppler, umożliwiający wizualizację przepływu krwi w czasie rzeczywistym.\n    • Sonda: Sonda o częstotliwości 2 MHz, dostosowana do większych zwierząt.\n    • Instrukcja: Nałóż żel na odpowiedni obszar i wybierz tryb Doppler, aby uzyskać obraz przepływów krwi w naczyniach, co pozwala ocenić stan układu krwionośnego.\n\n\n\n10. Typowe usterki i ich rozwiązania\n\n    1. Problem: Urządzenie nie włącza się.\nRozwiązanie:\n    • Sprawdź, czy akumulator jest odpowiednio naładowany.\n    • Podłącz urządzenie do zasilania i spróbuj ponownie.\n    • W przypadku braku reakcji wykonaj reset, odłączając zasilanie na kilka sekund.\n    • Jeśli problem nie ustępuje, skontaktuj się z serwisem.\n\n    2. Problem: Sonda nie działa prawidłowo.\nRozwiązanie:\n    • Upewnij się, że złącze sondy jest czyste i prawidłowo wpięte.\n    • Przeprowadź test diagnostyczny sondy dostępny w menu urządzenia.\n    • Jeśli błąd nadal występuje, skontaktuj się z serwisem.\n\n    3. Problem: Rozmazany obraz podczas badania.\nRozwiązanie:\n    • Dodaj więcej żelu transmisyjnego.\n    • Sprawdź, czy ustawienia urządzenia (np. głębokość) są dostosowane do badanego obszaru.\n    • Jeśli problem nie ustępuje, przeprowadź kalibrację obrazu w menu serwisowym.\n    • Skontaktuj się z serwisem.\n    4. Problem: Urządzenie zawiesza się podczas pracy.\nRozwiązanie:\n    • Wyłącz urządzenie i poczekaj kilka sekund przed ponownym uruchomieniem.\n    • Sprawdź, czy pamięć wewnętrzna urządzenia nie jest przepełniona.\n    • Jeśli problem powtarza się, wykonaj aktualizację oprogramowania.\n    • Skontaktuj się z serwisem.\n\n    5. Problem: Urządzenie przegrzewa się.\nRozwiązanie:\n    • Umieść urządzenie w dobrze wentylowanym miejscu, z dala od źródeł ciepła.\n    • Sprawdź, czy otwory wentylacyjne są czyste.\n    • Wyłącz urządzenie i odczekaj, aż ostygnie.\n    • Jeśli problem występuje ponownie, skontaktuj się z serwisem.\n\n    6. Problem: Ekran dotykowy nie reaguje.\nRozwiązanie:\n    • Wyczyść ekran delikatną ściereczką i upewnij się, że nie jest uszkodzony.\n    • Wykonaj kalibrację ekranu w menu serwisowym.\n    • Skontaktuj się z serwisem, jeśli problem się powtarza.\n\n    7. Problem: Brak dźwięku w trybie Doppler.\nRozwiązanie:\n    • Sprawdź poziom głośności w menu urządzenia.\n    • Przetestuj dźwięk za pomocą funkcji diagnostycznej.\n    • Jeśli problem nie ustępuje, skontaktuj się z serwisem.\n\n\n    8. Problem: Wyświetlacz działa nieprawidłowo (np. migocze).\nRozwiązanie:\n\n    • Upewnij się, że urządzenie jest podłączone do stabilnego źródła zasilania.\n    • Przeprowadź diagnostykę wyświetlacza w menu serwisowym.\n    • Skontaktuj się z serwisem, jeśli problem nie ustępuje.\n    9. Problem: Urządzenie działa wolniej niż zwykle.\nRozwiązanie:\n    • Sprawdź, czy w pamięci urządzenia nie znajdują się zbędne pliki. Usuń je, jeśli to konieczne.\n    • Upewnij się, że oprogramowanie jest aktualne.\n    • Skontaktuj się z serwisem, jeśli problem nie ustępuje.\n\n    10. Problem: Komunikat „Błąd systemu”.\nRozwiązanie:\n    • Wyłącz urządzenie i włącz je ponownie po kilku sekundach.\n    • Wykonaj reset do ustawień fabrycznych, jeśli problem się powtarza.\n    • Skontaktuj się z serwisem.\n\n11. Specyfikacja techniczna\n\n    • Typ urządzenia: Przenośny ultrasonograf.\n    • Zakres częstotliwości: 1.5–15 MHz.\n    • Wyświetlacz: Szerokokątny, 10.1 cala.\n    • Zasilanie: Akumulator litowo-jonowy, czas pracy do 4 godzin.\n    • Waga: 5.2 kg.\n    • Czas uruchamiania: < 25 sekund.\n\n12. Przykładowe użycia urządzenia\n\n    1. Jak przełączyć urządzenie na tryb B do badania narządów wewnętrznych?\n    • Włącz urządzenie i wybierz „Tryb B” z menu.\n    • Ustaw sondę na odpowiedniej głębokości, np. 5 cm dla jamy brzusznej.\n    • Nałóż cienką warstwę żelu transmisyjnego na sondę oraz badany obszar.\n    • Sprawdź obraz na ekranie i dostosuj ustawienia, jeśli to konieczne.\n\n    2. Jak poprawić jakość obrazu w trybie M do badania serca?\n    • Wybierz „Tryb M” w menu głównym.\n    • Ustaw sondę na odpowiedniej głębokości (ok. 3-4 cm dla serca).\n    • Ustaw jasność obrazu na średnią wartość, aby uzyskać lepszą widoczność.\n    • Użyj funkcji „Freeze Frame”, aby zatrzymać obraz i szczegółowo przeanalizować serce.\n\n    3. Jak zaktualizować oprogramowanie urządzenia?\n    • Przejdź do ustawień i wybierz „Aktualizacje oprogramowania”.\n    • Kliknij „Sprawdź dostępność aktualizacji”.\n    • Jeśli aktualizacja jest dostępna, kliknij „Pobierz i zainstaluj”.\n    • Urządzenie automatycznie zrestartuje się po zakończeniu instalacji.\n    4. Co zrobić, gdy urządzenie nie reaguje na przycisk zasilania?\n    • Upewnij się, że urządzenie jest podłączone do zasilania.\n    • Jeśli akumulator jest rozładowany, podłącz go do ładowarki na kilka minut.\n    • Spróbuj ponownie nacisnąć przycisk zasilania.\n    • Jeśli problem nie ustępuje, zresetuj urządzenie, przytrzymując przycisk przez 10 sekund.\n    5. Jak zmienić ustawienia jasności ekranu?\n    • Przejdź do ustawień obrazu.\n    • Zmień wartość „Jasność” na odpowiednią do warunków oświetleniowych.\n    • Ustaw kontrast, aby poprawić widoczność szczegółów na ekranie.\n    • Sprawdź obraz, aby upewnić się, że jest dobrze widoczny.\n    6. Jak przeprowadzić diagnostykę systemu?\n    • W menu serwisowym wybierz „Diagnostyka”.\n    • Urządzenie przeprowadzi automatyczny test systemu.\n    • Jeśli diagnostyka wykryje problemy, na ekranie pojawią się powiadomienia.\n    • Zapisz raport diagnostyczny i postępuj zgodnie z instrukcjami.\n    7. Co zrobić, gdy obraz na ekranie jest zniekształcony?\n    • Upewnij się, że urządzenie jest prawidłowo podłączone do źródła zasilania.\n    • Wybierz „Kalibrację wyświetlacza” w menu diagnostycznym.\n    • Przeprowadź kalibrację, dotykając wskazanych punktów na ekranie.\n    • Sprawdź, czy obraz poprawił się po kalibracji.\n    8. Jak ustawić tryb Doppler do badania przepływów krwi?\n    • W menu głównym wybierz „Kolorowy Doppler”.\n    • Nałóż żel na sondę i odpowiedni obszar skóry pacjenta.\n    • Umieść sondę na badanym naczyniu krwionośnym.\n    • Obserwuj przepływ krwi na ekranie w czasie rzeczywistym, zwracając uwagę na kolorowe oznaczenia.\n    9. Jak przeprowadzić reset ustawień fabrycznych?\n    • Przejdź do menu ustawień.\n    • Wybierz „Reset ustawień fabrycznych”.\n    • Potwierdź decyzję, klikając „Tak”.\n    • Urządzenie zrestartuje się i przywróci ustawienia domyślne.\n    10. Co zrobić, gdy urządzenie zaczyna się przegrzewać?\n    • Przenieś urządzenie do miejsca o lepszej wentylacji.\n    • Sprawdź, czy otwory wentylacyjne nie są zablokowane.\n    • Wyłącz urządzenie i pozwól mu ostygnąć przez kilka minut.\n    • Jeśli problem powtarza się, sprawdź, czy urządzenie nie jest używane w zbyt wysokiej temperaturze.\n    11. Jak wykonać test sondy ultrasonograficznej?\n    • Przejdź do menu „Diagnostyka”.\n    • Wybierz „Test sondy” i postępuj zgodnie z instrukcjami.\n    • Sprawdź, czy urządzenie wykrywa sondę i wyświetla odpowiedni obraz.\n    • Jeśli test jest nieudany, sprawdź porty i połączenie sondy.\n    12. Jak przeprowadzić kalibrację ekranu dotykowego?\n    • W menu diagnostycznym wybierz „Kalibracja ekranu”.\n    • Dotknij ekranu w wskazanych punktach na ekranie.\n    • Zatwierdź kalibrację i sprawdź, czy ekran reaguje prawidłowo.\n    • Jeśli problem nie ustępuje, sprawdź, czy ekran nie jest uszkodzony.\n    13. Jak wyłączyć urządzenie?\n    • Przytrzymaj przycisk zasilania przez 3 sekundy.\n    • Urządzenie powinno się wyłączyć.\n    • Jeśli urządzenie nie reaguje, sprawdź, czy jest prawidłowo podłączone do zasilania.\n    • Jeśli problem się powtarza, wykonaj reset.\n    14. Jak usunąć zbędne pliki z pamięci urządzenia?\n    • Przejdź do ustawień i wybierz „Zarządzanie pamięcią”.\n    • Wybierz „Usuń pliki” i sprawdź, które pliki można usunąć.\n    • Zatwierdź usunięcie plików, aby zwolnić miejsce.\n    • Sprawdź, czy urządzenie działa szybciej po usunięciu zbędnych plików.\n    15. Co zrobić, gdy sonda wydaje dziwne dźwięki?\n    • Upewnij się, że kabel sondy nie jest uszkodzony.\n    • Sprawdź, czy sonda jest prawidłowo podłączona do portu.\n    • Wykonaj test diagnostyczny sondy w menu urządzenia.\n    • Jeśli problem nie ustępuje, skontaktuj się z serwisem.",
        "metadata": {
          "device_model": "Vet Portable 15",
          "category": "troubleshooting",
          "source": "manual-v1.2"
        }
      }
    ],
    
    [
      {
        "content": "Instrukcja Obsługi - Vet Pro 70\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1. Opis urządzenia\nVet Pro 70 to przenośny system ultrasonograficzny sterowany oprogramowaniem, oparty na w pełni cyfrowej architekturze. Urządzenie oferuje szeroki zakres konfiguracji oraz zestaw funkcji umożliwiających wyświetlanie obrazów ultrasonograficznych w wysokiej rozdzielczości w czasie rzeczywistym. Dzięki elastyczności i zaawansowanym opcjom dostosowywania, Vet Pro 70 sprawdzi się zarówno w gabinetach weterynaryjnych, jak i w terenie.\n\n2. Specyficzne ostrzeżenia bezpieczeństwa\nOstrzeżenia dotyczące użytkowania urządzenia:\n    • Unikanie przegrzewania urządzenia: Urządzenie nie jest przystosowane do pracy w ekstremalnych temperaturach. Przegrzewanie może prowadzić do uszkodzenia podzespołów. Należy zapewnić odpowiednią wentylację i unikać narażania urządzenia na źródła ciepła.\n    • Ochrona przed wilgocią: Urządzenie jest wrażliwe na działanie wilgoci. Należy unikać jego używania w miejscach o dużej wilgotności, w pobliżu cieczy, w deszczu, lub w bezpośredniej bliskości wody.\n    • Unikanie przepięć: Urządzenie wyposażone jest w akumulator litowo-jonowy, który należy ładować wyłącznie przy użyciu dedykowanej ładowarki. Używanie nieodpowiednich źródeł zasilania może prowadzić do uszkodzenia urządzenia.\n    • Delikatność sprzętu: Sonda i ekran urządzenia są delikatne i należy z nimi obchodzić się ostrożnie, aby uniknąć uszkodzeń mechanicznych, w tym zarysowań ekranu dotykowego i uszkodzeń złącza sondy.\n    • Zalecane środki czystości: Sonda powinna być czyszczona wyłącznie za pomocą zatwierdzonych środków dezynfekujących, aby uniknąć jej uszkodzenia. Nigdy nie należy stosować agresywnych chemikaliów ani materiałów, które mogą zniszczyć powierzchnię sondy.\n    • Bezpieczne podłączenie sondy: Upewnij się, że sonda jest prawidłowo podłączona do portu urządzenia, aby uniknąć uszkodzenia portu oraz zapewnić stabilną transmisję danych.\n\n3. Akcesoria dostępne dla urządzenia\n    • Sonda ultrasonograficzna: Dostarczana w zestawie z urządzeniem. Różne rodzaje sond mogą być dostępne w zależności od zastosowań (np. dla większych zwierząt, dla precyzyjnych badań serca).\n    • Zasilacz sieciowy: Ładowarka do urządzenia, umożliwiająca ładowanie akumulatora litowo-jonowego.\n    • Dedykowane etui ochronne: Służy do transportu urządzenia, zapobiegając jego uszkodzeniom mechanicznym.\n    • Żel transmisyjny: Przeznaczony do nałożenia na sondę i skórę pacjenta, ułatwiający przeprowadzanie badania ultrasonograficznego.\n    • Kabel USB: Używany do przesyłania danych oraz aktualizacji oprogramowania urządzenia.\n\n\n4. Przygotowanie do pracy\n    1. Wyjmij urządzenie z opakowania i upewnij się, że wszystkie akcesoria (sonda, kabel zasilający, etui) są obecne.\n    2. Podłącz sondę ultrasonograficzną do jednego z dostępnych portów. Upewnij się, że połączenie jest stabilne.\n    3. Sprawdź poziom naładowania akumulatora. Jeśli jest niski, podłącz urządzenie do zasilania sieciowego.\n    4. Włącz urządzenie, naciskając i przytrzymując przycisk zasilania. Poczekaj na pełne załadowanie oprogramowania.\n    5. W menu głównym wybierz odpowiednią konfigurację badania (np. badanie jamy brzusznej, tkanek miękkich, serca).\n    6. Nałóż cienką warstwę żelu transmisyjnego na powierzchnię sondy oraz badany obszar skóry pacjenta.\n5. Tryby pracy\nVet Pro 70 oferuje zaawansowane tryby pracy, które można dostosować do potrzeb diagnostycznych:\n    • Tryb B: Standardowe obrazowanie w skali szarości do badania narządów wewnętrznych.\n    • Tryb M: Analiza ruchu narządów, np. podczas badania serca.\n    • Kolorowy Doppler: Obrazowanie przepływów naczyniowych w czasie rzeczywistym.\n    • Spektralny Doppler: Dokładne pomiary prędkości przepływu krwi.\n    • Tryb 3D: Trójwymiarowe obrazowanie struktur anatomicznych.\n    • Funkcja „Freeze Frame”: Zatrzymywanie obrazu w celu szczegółowej analizy.\n6. Konserwacja\n    1. Po każdym użyciu wyczyść obudowę urządzenia za pomocą miękkiej, wilgotnej szmatki. Unikaj stosowania agresywnych środków chemicznych.\n    2. Regularnie dezynfekuj sondę ultrasonograficzną zgodnie z zaleceniami producenta.\n    3. Sprawdzaj stan kabla sondy oraz portów w celu wykrycia ewentualnych uszkodzeń.\n    4. Aktualizuj oprogramowanie urządzenia, gdy tylko pojawią się nowe wersje.\n    5. Przechowuj urządzenie w suchym miejscu, z dala od wilgoci i kurzu. W trakcie transportu używaj dołączonego etui.\n    6. Raz na kwartał wykonaj diagnostykę systemową, dostępną w menu serwisowym.\n\n7. Diagnostyka oprogramowania \nDiagnostyka systemu:\n    • Dostęp do diagnostyki systemu: Urządzenie zawiera funkcję diagnostyki systemu, umożliwiającą sprawdzenie działania sondy, wyświetlacza, oraz innych komponentów. Ta opcja powinna być używana regularnie, aby upewnić się, że urządzenie działa poprawnie.\n    • Aktualizacja oprogramowania: Sprawdzaj dostępność aktualizacji oprogramowania, które mogą zawierać poprawki błędów lub nowe funkcje. W razie potrzeby, zainstaluj najnowszą wersję oprogramowania, aby zapewnić optymalną wydajność.\n\n8. Certyfikaty i normy\nZgodność z normami i certyfikaty:\n    • Certyfikat CE: Urządzenie jest zgodne z normami Unii Europejskiej dotyczącymi bezpieczeństwa i jakości urządzeń medycznych.\n    • Certyfikat FDA: Urządzenie jest zatwierdzone przez FDA, co oznacza, że spełnia wymagania amerykańskiej Agencji Żywności i Leków.\n    • IEC 60601-1: Urządzenie spełnia międzynarodowe normy dotyczące bezpieczeństwa elektrycznego urządzeń medycznych.\n    • ISO 13485: Urządzenie zostało wyprodukowane zgodnie z międzynarodową normą dotyczącą zarządzania jakością w produkcji wyrobów medycznych.\n\n9. Przykładowe przypadki użycia\n9.1 Badanie serca u psa:\n    • Tryb pracy: Tryb M (Motion), idealny do analizy ruchu narządów.\n    • Sonda: Sonda 5 MHz, dostosowana do średnich i dużych zwierząt.\n    • Instrukcja: Nałóż żel na sondę i pacjenta, umieść sondę na klatce piersiowej, a następnie wybierz tryb M, aby uzyskać obraz ruchu serca.\n9.2 Badanie jamy brzusznej kota:\n    • Tryb pracy: Tryb B (Basic), do obrazowania w skali szarości.\n    • Sonda: Sonda 7 MHz, idealna do małych zwierząt.\n    • Instrukcja: Ustaw odpowiednią głębokość skanowania i nałóż żel na obszar jamy brzusznej, aby uzyskać wyraźny obraz narządów.\n9.3 Badanie przepływów krwi u konia:\n    • Tryb pracy: Kolorowy Doppler, umożliwiający wizualizację przepływów krwi.\n    • Sonda: Sonda 2 MHz, dostosowana do dużych zwierząt.\n    • Instrukcja: Nałóż żel na obszar naczynia krwionośnego i wybierz tryb Doppler, aby ocenić przepływ krwi w czasie rzeczywistym.\n\n10. Typowe usterki i ich rozwiązania\n1. Problem: Urządzenie nie wykrywa sondy.\nRozwiązanie:\n    • Upewnij się, że sonda jest prawidłowo podłączona do portu.\n    • Sprawdź, czy port sondy nie jest zanieczyszczony. Oczyść go, jeśli to konieczne.\n    • Jeśli problem się powtarza, przetestuj inną sondę.\n    • Skontaktuj się z serwisem.\n\n2. Problem: Obraz jest zbyt ciemny.\nRozwiązanie:\n    • Dostosuj jasność oraz kontrast obrazu w menu ustawień.\n    • Upewnij się, że żel transmisyjny został równomiernie nałożony.\n    • Jeśli problem nie ustępuje, wykonaj diagnostykę wyświetlacza.\n    • Skontaktuj się z serwisem.\n\n3. Problem: Urządzenie wyświetla komunikat „Błąd pamięci”.\nRozwiązanie:\n    • Usuń zbędne pliki przechowywane w pamięci urządzenia.\n    • Sformatuj pamięć w menu ustawień (po wcześniejszym zapisaniu ważnych danych).\n    • Jeśli problem się powtarza, skontaktuj się z serwisem.\n\n4. Problem: Przegrzewanie się urządzenia.\nRozwiązanie:\n    • Sprawdź, czy otwory wentylacyjne urządzenia są czyste i niezatkane.\n    • Umieść urządzenie w miejscu z dobrą wentylacją, z dala od źródeł ciepła.\n    • Wyłącz urządzenie i odczekaj, aż ostygnie.\n    • Jeśli problem się powtarza, skontaktuj się z serwisem.\n\n5. Problem: Urządzenie zawiesza się podczas pracy.\nRozwiązanie:\n    • Wyłącz urządzenie, odczekaj kilka sekund i włącz je ponownie.\n    • Sprawdź, czy oprogramowanie jest aktualne. Jeśli nie, wykonaj aktualizację.\n    • W przypadku dalszych problemów skontaktuj się z serwisem.\n\n6. Problem: Brak dźwięku w trybie Doppler.\nRozwiązanie:\n    • Sprawdź ustawienia głośności w menu urządzenia.\n    • Upewnij się, że sonda prawidłowo kontaktuje z badanym obszarem.\n    • Jeśli problem się powtarza, przeprowadź diagnostykę dźwięku w menu serwisowym.\n    • Skontaktuj się z serwisem.\n\n7. Problem: Komunikat „Błąd systemu”.\nRozwiązanie:\n    • Uruchom ponownie urządzenie.\n    • Jeśli problem nie ustępuje, wykonaj reset ustawień fabrycznych w menu serwisowym.\n    • Skontaktuj się z serwisem.\n\n8. Problem: Wyświetlacz migocze lub jest niewyraźny.\nRozwiązanie:\n    • Sprawdź, czy urządzenie jest prawidłowo podłączone do stabilnego źródła zasilania.\n    • Przeprowadź diagnostykę wyświetlacza w menu serwisowym.\n    • Skontaktuj się z serwisem, jeśli problem nie ustępuje.\n\n9. Problem: Czas ładowania urządzenia jest zbyt długi.\nRozwiązanie:\n    • Upewnij się, że akumulator jest odpowiednio naładowany.\n    • Sprawdź stan ładowarki oraz kabel zasilający.\n    • W przypadku dalszych problemów skontaktuj się z serwisem.\n\n10. Problem: Sonda emituje nietypowe dźwięki.\nRozwiązanie:\n    • Sprawdź, czy kabel sondy nie jest uszkodzony.\n    • Wykonaj diagnostykę sondy w menu urządzenia.\n    • Jeśli problem nie ustępuje, skontaktuj się z serwisem.\n\n11. Specyfikacja techniczna\n    • Typ urządzenia: Przenośny ultrasonograf.\n    • Zakres częstotliwości: 1.5–15 MHz.\n    • Wyświetlacz: Szerokokątny, 10.1 cala.\n    • Zasilanie: Akumulator litowo-jonowy, czas pracy do 4 godzin.\n    • Waga: 5.2 kg.\n    • Czas uruchamiania: < 25 sekund.\n\n12. Przykładowe użycia urządzenia\n\n    1. Jak włączyć urządzenie i przejść do menu głównego?\n    • Naciśnij przycisk zasilania przez 3 sekundy.\n    • Po załadowaniu systemu, przejdź do menu głównego.\n    • Wybierz odpowiednią funkcję badania, np. jamę brzuszną lub serce.\n    2. Jak dostosować ustawienia głębokości skanowania?\n    • Wybierz tryb B z menu głównego.\n    • Ustaw głębokość skanowania na odpowiednią wartość (np. 4 cm dla badań brzusznych).\n    • Zatwierdź ustawienia i sprawdź obraz.\n    3. Jak wykonać kalibrację sondy?\n    • Przejdź do menu „Diagnostyka”.\n    • Wybierz „Kalibracja sondy”.\n    • Postępuj zgodnie z instrukcjami na ekranie.\n    4. Co zrobić, gdy ekran dotykowy nie reaguje?\n    • Upewnij się, że ekran jest czysty i nie ma na nim zabrudzeń.\n    • Wykonaj kalibrację ekranu w menu ustawień.\n    • Jeśli problem nie ustępuje, skontaktuj się z serwisem.\n    5. Jak poprawić jakość obrazu w trybie Doppler?\n    • Upewnij się, że na sondzie jest wystarczająca ilość żelu transmisyjnego.\n    • Dostosuj jasność oraz kontrast obrazu w menu ustawień.\n    • Ustaw odpowiednią głębokość, aby uzyskać wyraźniejszy obraz.\n    6. Jak sprawdzić status akumulatora?\n    • Naciśnij przycisk zasilania.\n    • Przejdź do menu ustawień i wybierz „Stan akumulatora”.\n    • Jeśli akumulator jest niski, podłącz urządzenie do ładowania.\n    7. Jak wykonać reset urządzenia?\n    • Przytrzymaj przycisk zasilania przez 10 sekund, aby wyłączyć urządzenie.\n    • Następnie ponownie włącz urządzenie.\n    • Sprawdź, czy problem został rozwiązany.\n    8. Jak przeprowadzić test sondy?\n    • W menu wybierz „Diagnostyka”.\n    • Kliknij „Test sondy” i postępuj zgodnie z instrukcjami.\n    • Jeśli wynik testu jest negatywny, sprawdź połączenie sondy z urządzeniem.\n    9. Co zrobić, gdy urządzenie nie wykrywa sondy?\n    • Upewnij się, że sonda jest prawidłowo podłączona.\n    • Wyczyść złącza sondy, aby usunąć zabrudzenia.\n    • Sprawdź, czy porty są czyste i nieuszkodzone.\n    10. Jak przeprowadzić kalibrację wyświetlacza?\n    • W menu ustawień wybierz „Kalibracja ekranu”.\n    • Postępuj zgodnie z instrukcjami na ekranie.\n    • Po zakończeniu, ekran dotykowy powinien działać precyzyjnie.\n    11. Jak poprawić jasność obrazu na ekranie?\n    • W menu ustawień wybierz „Jasność”.\n    • Ustaw odpowiednią wartość jasności, aby obraz był wyraźny.\n    • Dostosuj kontrast, aby poprawić widoczność detali.\n    12. Co zrobić, gdy urządzenie przegrzewa się?\n    • Upewnij się, że urządzenie jest w odpowiedniej temperaturze otoczenia.\n    • Sprawdź, czy wentylacja urządzenia nie jest zablokowana.\n    • Wyłącz urządzenie i pozwól mu ostygnąć.\n    13. Jak przeprowadzić diagnostykę systemową?\n    • W menu serwisowym wybierz „Diagnostyka systemu”.\n    • Urządzenie przeprowadzi test wszystkich podzespołów.\n    • Zapisz raport diagnostyczny i postępuj zgodnie z instrukcjami.\n    14. Jak wyłączyć urządzenie?\n    • Przytrzymaj przycisk zasilania przez 3 sekundy.\n    • Urządzenie się wyłączy.\n    • Jeśli urządzenie nie wyłączy się, sprawdź, czy jest odpowiednio podłączone do zasilania.\n    15. Jak usunąć błędy pamięci?\n    • W menu ustawień wybierz „Zarządzanie pamięcią”.\n    • Usuń zbędne pliki, aby zwolnić miejsce.\n    • Sformatuj pamięć, jeśli problem nie ustępuje.\n\n\n\n\n",
        "metadata": {
          "device_model": "Vet Pro 70",
          "category": "troubleshooting",
          "source": "manual-v1.2"
        }
      }
    ],
    
    [
      {
        "content": "Instrukcja Obsługi - Vet Pro-Key 75\n    1. Opis urządzenia\n\nVet Pro-Key 75 to przenośny system ultrasonograficzny zaprojektowany do zaawansowanej diagnostyki weterynaryjnej. Urządzenie wyposażone jest w szerokokątny wyświetlacz z powłoką antyrefleksyjną, intuicyjny interfejs oraz\ntechnologię szybkiego startu, dzięki której urządzenie jest gotowe do pracy w mniej niż 25 sekund. Dzięki kompaktowej budowie i wydajnemu akumulatorowi idealnie nadaje się do pracy stacjonarnej i w terenie.\n\n2. Specyficzne ostrzeżenia bezpieczeństwa\nOstrzeżenia dotyczące bezpieczeństwa użytkownika i pacjenta:\n    • Zabezpieczenie przed pożarem: Nie używaj urządzenia w pobliżu łatwopalnych gazów lub substancji znieczulających. Grozi to wybuchem. Upewnij się, że urządzenie jest wykorzystywane w odpowiednich warunkach, zgodnych z normą IEC 60601-1.\n    • Zalecenia dotyczące środowiska: Urządzenie należy używać w dobrze wentylowanym pomieszczeniu, w temperaturze pokojowej. Unikaj wystawiania urządzenia na bezpośrednie działanie światła słonecznego oraz przechowywania go w miejscach o wysokiej wilgotności. Zakazane jest używanie urządzenia w miejscach, w których może być narażone na zakłócenia elektromagnetyczne (np. telefony komórkowe, urządzenia radiowe).\n    • Bezpieczeństwo biologiczne: Urządzenie i głowice muszą być odpowiednio czyszczone i dezynfekowane, aby uniknąć przenoszenia zakażeń. Używaj tylko zatwierdzonych środków dezynfekujących i przestrzegaj zaleceń producenta.\n    • Przestrogi dotyczące sondy: Należy upewnić się, że sonda jest prawidłowo podłączona i sprawna, aby zapobiec uszkodzeniu urządzenia lub narażeniu pacjenta na niebezpieczeństwo. Nie należy używać uszkodzonych sond.\n3. Akcesoria dostępne dla urządzenia\nLista akcesoriów:\n    • Sondy ultrasonograficzne: Dostępne różne rodzaje sond, w tym sondy do badań ogólnych, kardiologicznych oraz do badań płodu.\n    • Zasilacze: Zasilacz sieciowy do pracy stacjonarnej. Akumulator litowo-jonowy, który zapewnia do 4 godzin pracy urządzenia.\n    • Stojak opcjonalny: Umożliwia wygodne umieszczenie urządzenia w trakcie długotrwałych badań.\n    • Folia ochronna na ekran: Chroni wyświetlacz przed zarysowaniami i uszkodzeniami podczas transportu.\nWskazówka: Używanie zatwierdzonych akcesoriów gwarantuje prawidłowe funkcjonowanie urządzenia oraz bezpieczeństwo użytkownika.\n4. Przygotowanie do pracy\n\n        1. Umieść urządzenie na stabilnej powierzchni lub opcjonalnym stojaku.\n        2. Podłącz sondę ultrasonograficzną do odpowiedniego portu.\n        3. Upewnij się, że akumulator jest naładowany lub podłącz urządzenie do zasilania\nsieciowego.\n        4. Włącz urządzenie przyciskiem zasilania i poczekaj na załadowanie systemu.\n        5. Nałóż żel transmisyjny na sondę oraz na obszar badany.\n        6. Sprawdź, czy ustawienia urządzenia są odpowiednie dla badanej struktury\nanatomicznej.\n\n5. Tryby pracy\n\nVet Pro-Key 75 oferuje następujące tryby pracy:\n    • Tryb B: Obrazowanie w skali szarości, używane do oceny kształtu i struktury narządów.\n    • Tryb M: Obrazowanie w ruchu, szczególnie przydatne w badaniach serca.\n    • Doppler: Obrazowanie przepływu krwi w kolorze, umożliwia ocenę przepływów\nnaczyniowych.\n    • Tryb PW Doppler: Pulsacyjny Doppler pozwala na dokładną ocenę prędkości przepływu krwi.\n    • Tryb harmonijny: Umożliwia bardziej szczegółowe obrazowanie struktur.\n\n\n6. Konserwacja\n\n    1. Regularnie czyść obudowę urządzenia miękką, wilgotną szmatką, unikając używania agresywnych środków chemicznych.\n    2. Do czyszczenia sondy używaj dedykowanych środków dezynfekcyjnych,\nzgodnych z zaleceniami producenta.\n    3. Sprawdzaj, czy porty są czyste i wolne od zanieczyszczeń.\n    4. Przechowuj urządzenie w suchym miejscu w temperaturze pokojowej, z dala od źródeł wilgoci i kurzu.\n    5. Raz na kwartał wykonaj diagnostykę systemu, dostępną w menu urządzenia.\n    6. Nie zostawiaj urządzenia w bezpośrednim świetle słonecznym ani w temperaturach przekraczających 40°C.\n\n7. Diagnostyka oprogramowania i wsparcie techniczne\nDiagnostyka systemu:\n    • Test diagnostyczny urządzenia: Co kwartał wykonuj test diagnostyczny urządzenia, dostępny w menu serwisowym. Test obejmuje sprawdzenie działania wyświetlacza, sondy oraz połączeń z urządzeniem.\n    • Aktualizacja oprogramowania: Sprawdź, czy urządzenie jest zaktualizowane. W przypadku dostępnych nowych wersji oprogramowania, postępuj zgodnie z instrukcjami na ekranie, aby zaktualizować system.\n    • Problemy z oprogramowaniem: Jeśli urządzenie zawiesza się lub występują błędy systemowe, wykonaj reset urządzenia. W przypadku problemów, które nie ustępują, skontaktuj się z działem wsparcia technicznego.\n\n8. Certyfikaty i normy\nZgodność z normami i certyfikaty:\n    • Certyfikat CE: Urządzenie spełnia wymagania dyrektyw Unii Europejskiej dotyczących bezpieczeństwa i zdrowia użytkownika.\n    • Certyfikat FDA: Zgodność z wymaganiami Amerykańskiej Agencji Żywności i Leków (FDA) dla urządzeń medycznych.\n    • Norma IEC 60601-1: Urządzenie jest zgodne z międzynarodową normą bezpieczeństwa dla urządzeń elektrycznych wykorzystywanych w medycynie.\nDeklaracja zgodności: Urządzenie zostało zaprojektowane i wyprodukowane zgodnie z rygorystycznymi normami jakości, aby zapewnić niezawodność i bezpieczeństwo w diagnostyce weterynaryjnej.\n\n9. Przykładowe przypadki użycia\nPrzykład 1: Badanie płodu u psa\n    • Tryb pracy: Tryb B (obrazowanie w skali szarości).\n    • Sonda: Sonda 3-5 MHz dla większych zwierząt.\n    • Zalecenia: Użyj minimalnej głębokości skanowania, aby uzyskać dokładny obraz. Upewnij się, że żel transmisyjny jest nałożony równomiernie na skórę pacjenta, aby uniknąć artefaktów w obrazie.\nPrzykład 2: Badanie jamy brzusznej kota\n    • Tryb pracy: Tryb Doppler (ocena przepływu krwi w naczyniach).\n    • Sonda: Sonda 7-10 MHz, zależnie od rozmiaru ciała.\n    • Zalecenia: Ustaw wyższe czułość i głębokość skanowania, aby uzyskać lepszą wizualizację tkanek wewnętrznych. Jeśli problem dotyczy małych narządów, użyj trybu harmonijnego w celu poprawienia jakości obrazu.\n\n\n10. Typowe usterki i ich rozwiązania\n\n    1. Problem: Brak reakcji urządzenia na przycisk zasilania.\nRozwiązanie:\n    • Sprawdź, czy urządzenie jest podłączone do zasilania.\n    • Naładuj akumulator przez co najmniej 30 minut, jeśli jest rozładowany.\n    • Jeśli problem się powtarza, wykonaj reset urządzenia, odłączając je odzasilania na 10 sekund.\n    • Jeśli żadna z powyższych metod nie zadziała, skontaktuj się z serwisem.\n\n\n    2. Problem: Komunikat „Błąd sondy”.\nRozwiązanie:\n    • Odłącz sondę i ponownie podłącz, upewniając się, że port jest czysty.\n    • Sprawdź, czy kabel sondy nie jest uszkodzony.\n    • Przeprowadź diagnostykę sondy w menu serwisowym.\n    • Jeśli problem nie ustępuje, skontaktuj się z serwisem.\n\n    3. Problem: Rozmazany obraz.\nRozwiązanie:\n    • Nałóż więcej żelu transmisyjnego, upewnij się, że nie ma pęcherzyków powietrza między sondą a skórą.\n    • Zmień ustawienia głębokości skanowania i czułości w menu urządzenia.\n    • Jeśli problem nadal występuje, skontaktuj się z serwisem.\n\n\n    4. Problem: Brak obrazu na wyświetlaczu.\nRozwiązanie:\n    • Sprawdź jasność wyświetlacza w ustawieniach.\n    • Upewnij się, że urządzenie jest w pełni włączone.\n    • Wykonaj test diagnostyczny wyświetlacza dostępny w menu serwisowym.\n    • Jeśli problem się nie rozwiąże, skontaktuj się z serwisem.\n\n    5. Problem: Urządzenie zawiesza się podczas pracy.\nRozwiązanie:\n    • Wyłącz urządzenie i odczekaj 10 sekund przed ponownym włączeniem.\n    • Sprawdź, czy oprogramowanie urządzenia jest aktualne.\n    • Wykonaj reset do ustawień fabrycznych.\n    • Jeśli żadna z powyższych metod nie przyniesie efektu, skontaktuj się z serwisem.\n\n    6. Problem: Urządzenie wyświetla komunikat „Przegrzanie”.\nRozwiązanie:\n    • Wyłącz urządzenie i odczekaj, aż ostygnie.\n    • Sprawdź, czy otwory wentylacyjne nie są zatkane i oczyść je w razie potrzeby.\n    • Umieść urządzenie w dobrze wentylowanym miejscu, z dala od źródeł ciepła.\n    • Jeśli urządzenie nadal się przegrzewa, skontaktuj się z serwisem.\n\n        7. Problem: Brak dźwięku w trybie Doppler.\nRozwiązanie:\n    • Sprawdź ustawienia głośności w menu urządzenia.\n    • Upewnij się, że sonda jest prawidłowo umieszczona na skórze pacjenta.\n    • Przetestuj urządzenie w trybie diagnostycznym, aby sprawdzić funkcję dźwięku.\n    • Jeśli problem nie ustępuje, skontaktuj się z serwisem.\n        8. Problem: Urządzenie wolno się uruchamia.\nRozwiązanie:\n    • Upewnij się, że pamięć urządzenia nie jest przepełniona.\n    • Usuń niepotrzebne pliki lub przenieś je na zewnętrzny nośnik.\n    • Jeśli problem nie ustąpi, skontaktuj się z serwisem.\n\n        9. Problem: Komunikat „Błąd pamięci”.\nRozwiązanie:\n    • Wykonaj formatowanie pamięci w menu ustawień.\n    • Sprawdź, czy dane są poprawnie zapisywane w formacie DICOM.\n    • Jeśli problem nadal występuje, skontaktuj się z serwisem.\n\n        10. Problem: Sonda emituje dziwne dźwięki.\nRozwiązanie:\n    • Sprawdź, czy kabel sondy nie jest uszkodzony.\n    • Przeprowadź diagnostykę sondy w menu serwisowym.\n    • Jeśli problem się nie rozwiąże, skontaktuj się z serwisem.\n\n11. Specyfikacja techniczna\n\n    • Typ urządzenia: Przenośny ultrasonograf.\n    • Zakres częstotliwości: 1.5–15 MHz.\n    • Wyświetlacz: Szerokokątny, 10.1 cala.\n    • Zasilanie: Akumulator litowo-jonowy, czas pracy do 4 godzin.\n    • Waga: 5.2 kg.\n    • Czas uruchamiania: < 25 sekund.\n\n12. Przykładowe użycia urządzenia\n\n    1. Jak przełączyć urządzenie na tryb B do badania narządów?\n    • Włącz urządzenie i wybierz „Tryb B” z menu.\n    • Ustaw sondę na odpowiedniej głębokości, zależnie od badanego narządu.\n    • Nałóż żel transmisyjny na sondę i obszar skóry pacjenta.\n    • Obserwuj obraz na ekranie i dostosuj parametry, jeśli to konieczne.\n\n    2. Jak zwiększyć jasność obrazu?\n    • W menu ustawień wybierz „Jasność” obrazu.\n    • Ustaw wartość jasności na 75% i sprawdź, czy obraz jest wyraźniejszy.\n    • Dostosuj kontrast, jeśli to potrzebne.\n    • Sprawdź obraz, aby upewnić się, że jest odpowiednio widoczny.\n\n    3. Jak zresetować ustawienia fabryczne?\n    • W menu głównym wybierz „Ustawienia”.\n    • Zjedź do „Reset ustawień fabrycznych”.\n    • Wybierz „Tak” i urządzenie powróci do domyślnych ustawień.\n    • Uruchom urządzenie ponownie.\n\n    4. Jak sprawdzić stan naładowania akumulatora?\n    • Włącz urządzenie.\n    • W menu głównym wybierz „Stan akumulatora”.\n    • Sprawdź poziom naładowania.\n    • Jeśli bateria jest bliska rozładowania, podłącz urządzenie do ładowania.\n\n    5. Jak przeprowadzić test sondy?\n    • W menu urządzenia wybierz „Diagnostyka”.\n    • Kliknij „Test sondy” i postępuj zgodnie z instrukcjami.\n    • Sprawdź, czy test przebiega pomyślnie.\n    • Jeśli test wykazuje problem, sprawdź połączenie sondy.\n\n    6. Jak zaktualizować oprogramowanie urządzenia?\n    • Zaloguj się do systemu aktualizacji oprogramowania.\n    • Wybierz „Sprawdź dostępność aktualizacji”.\n    • Kliknij „Pobierz” i „Zainstaluj” nową wersję.\n    • Urządzenie automatycznie się zrestartuje po zakończeniu procesu.\n\n    7. Jak poprawić rozmazany obraz w trybie Doppler?\n    • Upewnij się, że na sondzie jest wystarczająca ilość żelu transmisyjnego.\n    • Sprawdź, czy sonda jest odpowiednio ustawiona na skórze pacjenta.\n    • Dostosuj ustawienia głębokości skanowania i kontrastu.\n    • Jeśli obraz nadal jest rozmazany, wykonaj test wyświetlacza.\n\n    8. Co zrobić, gdy urządzenie nie włącza się?\n    • Upewnij się, że urządzenie jest podłączone do źródła zasilania.\n    • Jeśli akumulator jest rozładowany, podłącz go do ładowarki.\n    • Spróbuj ponownie włączyć urządzenie.\n\n    9. Jeśli nie reaguje, zresetuj urządzenie, odłączając je od zasilania na 10 sekund.\n    • Jak przeprowadzić kalibrację obrazu?\n    • W menu serwisowym wybierz „Kalibracja obrazu”.\n    • Zastosuj odpowiednie ustawienia dla różnych typów badania (np. serce, jamę brzuszną).\n    • Zatwierdź ustawienia i sprawdź poprawność obrazu.\n    • Jeśli obraz nie jest poprawny, skontaktuj się z serwisem.\n\n    10. Jak sprawdzić, czy porty urządzenia są czyste?\n    • Upewnij się, że urządzenie jest wyłączone.\n    • Sprawdź porty na obecność kurzu lub brudu.\n    • Jeśli porty są brudne, użyj sprężonego powietrza do ich oczyszczenia.\n    • Upewnij się, że porty są suché i wolne od zanieczyszczeń.\n\n    11. Jak zresetować ustawienia sondy?\n    • Przejdź do menu diagnostycznego.\n    • Wybierz „Reset ustawień sondy”.\n    • Urządzenie automatycznie przywróci fabryczne ustawienia sondy.\n    • Sprawdź, czy problem z sondą został rozwiązany.\n\n    12. Co zrobić, gdy ekran dotykowy nie reaguje?\n    • Upewnij się, że ekran jest czysty i nie ma na nim zabrudzeń.\n    • Sprawdź, czy ekran nie jest uszkodzony.\n    • Jeśli problem nadal występuje, wykonaj kalibrację ekranu w menu serwisowym.\n\n    13. Jakie środki czyszczące używać do konserwacji urządzenia?\n    • Używaj tylko zalecanych środków czyszczących, które są bezpieczne dla urządzenia.\n    • Unikaj środków zawierających alkohol, ponieważ mogą uszkodzić obudowę.\n    • Przetrzyj urządzenie delikatnie, aby uniknąć zarysowań.\n\n    14. Jak przeprowadzić test wyświetlacza?\n    • W menu diagnostycznym wybierz „Test wyświetlacza”.\n    • Sprawdź, czy na ekranie pojawiają się jakiekolwiek zniekształcenia obrazu.\n    • Jeśli obraz jest wyraźny, test przebiegł pomyślnie.\n\n    15. Jak rozwiązać problem z błędem pamięci?\n    • Sprawdź pamięć urządzenia w ustawieniach.\n    • Usuń zbędne pliki, które mogą zajmować miejsce.\n    • Sformatuj pamięć, jeśli problem nadal występuje.",
        "metadata": {
          "device_model": "Vet Pro-Key 75",
          "category": "troubleshooting",
          "source": "manual-v1.2"
        }
      }
    ]
    ]